_Rarzrabotki/Kazna/AccumulationRegisters/ЛимитыДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ЛимитыДДС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/Enums/ВидыОперацийСчетНаОплатуПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыОперацийСчетНаОплатуПоставщику</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаОплату</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Транзит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Kazna/AccumulationRegisters/ЛимитыДДС/Ext/RecordSetModule.bsl
Процедура ВыполнитьДвижения(Объект, ВидДвижения)
	
   //Направление= Справочники.Направления.ПустаяСсылка();
		
	НоваяСтрока					= Добавить();
	НоваяСтрока.ВидДвижения 	= ВидДвижения;
	НоваяСтрока.Период 			= Объект.Дата;
	НоваяСтрока.Подразделение 	= Объект.Подразделение;
	НоваяСтрока.СтатьяДвиженияДенежныхСредств 	= Объект.СтатьяДвиженияДенежныхСредств;
	НоваяСтрока.ВидОплаты 	= Объект.ВидОплаты;        
	
	Если ТипЗнч(Объект)= Тип("ДокументОбъект.ЗаявкаНаРасходованиеДенежныхСредств") Тогда
		НоваяСтрока.Направление = 	Объект.СчетНаОплатуПоставщика.Направление;
	КонецЕсли;                                         

	
	НоваяСтрока.Сумма 			= Объект.СуммаДокумента;

	Записывать = Истина;
	
КонецПроцедуры

Процедура ВыполнитьПриход(Объект) Экспорт
	
	ВыполнитьДвижения(Объект, ВидДвиженияНакопления.Приход);
	
КонецПроцедуры

Функция НадоСписыватьЛимиты(Объект) Экспорт
	
	ДатаНачалаИспользования = Константы.Лимиты_ДатаНачалаИспользования.Получить();
	Если Не ЗначениеЗаполнено(ДатаНачалаИспользования) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Объект.Дата<ДатаНачалаИспользования Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МетаданныеОбъекта = Объект.Метаданные();
	Если МетаданныеОбъекта.Реквизиты.Найти("СчетНаОплатуПоставщика")<>Неопределено
		И Объект.СчетНаОплатуПоставщика.ВидОперации=Перечисления.ВидыОперацийСчетНаОплатуПоставщику.Транзит
		И Объект.Дата>=Дата(2016, 10, 18) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ВыполнитьРасход(Объект) Экспорт
		
	ВыполнитьДвижения(Объект, ВидДвиженияНакопления.Расход);
	
КонецПроцедуры
